//=============================================================================
//
// エネミーモデル処理 [HI.h]
// Author : HAL東京 高橋諒
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_HI		(9)					// エネミーの数

#define	HI_SIZE		(7.0f)				// 当たり判定の大きさ


//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct EVENT
{
	XMFLOAT4X4			mtxWorld;			// ワールドマトリックス
	XMFLOAT3			pos;				// モデルの位置
	XMFLOAT3			rot;				// モデルの向き(回転)
	XMFLOAT3			scl;				// モデルの大きさ(スケール)

	BOOL				use;
	BOOL				load;

	float				spd;				// 移動スピード
	float				size;				// 当たり判定の大きさ
	int					shadowIdx;			// 影のインデックス番号

	float				time;			// 線形補間用
	int					tblNo;			// 行動データのテーブル番号
	int					tblMax;			// そのテーブルのデータ数

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEvent(void);
void UninitEvent(void);
void UpdateEvent(void);
void DrawEvent(void);

EVENT *GetEvent(void);

void EventSkip(void);
