//=============================================================================
//
// objモデル処理 [0bj.cpp]
// Author : HAL東京 高橋諒
//
//=============================================================================
#pragma once



//*****************************************************************************
// マクロ定義
//*****************************************************************************
struct OBJ
{
	XMFLOAT3		pos;		// ポリゴンの位置
	XMFLOAT3		rot;		// ポリゴンの向き(回転)
	XMFLOAT3		scl;		// ポリゴンの大きさ(スケール)
	BOOL			use;

	XMFLOAT4X4		mtxWorld;	// ワールドマトリックス

	int				modelIdx;

};

struct OBJ_MODEL
{
	DX11_MODEL		model;		// モデル情報
	bool			load;
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitObj(void);
void UninitObj(void);
void UpdateObj(void);
void DrawObj(void);

OBJ* GetObj(void);
