//=============================================================================
//
// リザルト画面処理 [result.h]
// Author : HAL東京 高橋諒
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "sprite.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum 
{
	TUTORIAL_TITLE,
	TUTORIAL_FADE,
	TUTORIAL_SOUSA,
	TUTORIAL_TRIGGER,

	TUTORIAL_MAX
};



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);


